In [3]:
#Creating an Empty DataFrame

import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
#Creating an DataFrame from list

import pandas as pd
data=[1,2,3,4,5]
df=pd.DataFrame(data, columns=['Numbers'])
print(df)

   Numbers
0        1
1        2
2        3
3        4
4        5

In [9]:
#Creating an DataFrame from lists of lists

import pandas as pd
data=['Jaya',23],['Keerthana',25],['Bhuvana',23]
df=pd.DataFrame(data, columns=['Names','age'])
print(df)

       Names  age
0       Jaya   23
1  Keerthana   25
2    Bhuvana   23

In [12]:
#Creating an DataFrame from Dictionery of lists

import pandas as pd
data={'Vegetables(Kg)':['Tamoto','Potato','Carrot',],
     'Price':[100,30,40]}
df=pd.DataFrame(data)
print(df)

  Vegetables(Kg)  Price
0         Tamoto    100
1         Potato     30
2         Carrot     40

In [15]:
#Creating an DataFrame from Dictionery of lists providing index label explicitily

import pandas as pd
data={'Names':['Uma','Charan','Narendra',],
     'Marks':[96,98,95]}
df=pd.DataFrame(data,index=['rank2','rank1','rank3'])
print(df)

          Names  Marks
rank2       Uma     96
rank1    Charan     98
rank3  Narendra     95

In [18]:
#Creating an DataFrame from lists of Dictionery
#Here By default dictionary keys will be taken as coulmns
import pandas as pd
data=[{'a':2,'b':3,'C':4},
    {'a':7,'b':8,'C':9}]
df=pd.DataFrame(data)
print(df)

   a  b  C
0  2  3  4
1  7  8  9

In [19]:
#Slicing Pandas Data using DataFrame
# importing pandas library
import pandas as pd

# Initializing the nested list with Data set
player_list = [['M.S.Dhoni', 36, 75, 5428000],
              ['A.B.D Villers', 38, 74, 3428000],
              ['V.Kholi', 31, 70, 8428000],
              ['S.Smith', 34, 80, 4428000],
              ['C.Gayle', 40, 100, 4528000],
              ['J.Root', 33, 72, 7028000],
              ['K.Peterson', 42, 85, 2528000]]

# creating a pandas dataframe
df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])

# data frame before slicing
df

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [20]:
#Slicing the rows data frame
df1=df.iloc[0:5]
print(df1)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000

In [22]:
#Slicing the columns data frame
df2=df.iloc[ : ,0:2]
print(df2)

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kholi   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [23]:
#Indexing pandas from data frame
# importing pandas library
import pandas as pd

# Initializing the nested list with Data set
player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kholi', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

# creating a pandas dataframe and indexing it using Aplhabets
df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'],
                               index=['A', 'B', 'C', 'D', 'E', 'F', 'G'])


# Displaying data frame
df

            Name  Age  Weight   Salary
A      M.S.Dhoni   36      75  5428000
B  A.B.D Villers   38      74  3428000
C        V.Kholi   31      70  8428000
D        S.Smith   34      80  4428000
E        C.Gayle   40     100  4528000
F         J.Root   33      72  7028000
G     K.Peterson   42      85  2528000

In [24]:
#Manipulating the data from data frame
#Applying lambda function to a column using Dataframe.assign()
# importing pandas library
import pandas as pd

# creating and initializing a list
values = [['Rohan', 455], ['Elvish', 250], ['Deepak', 495],
          ['Sai', 400], ['Radha', 350], ['Vansh', 450]]

# creating a pandas dataframe
df = pd.DataFrame(values, columns=['Name', 'Univ_Marks'])

# Applying lambda function to find percentage of
# 'Univ_Marks' column using df.assign()
df = df.assign(Percentage=lambda x: (x['Univ_Marks'] / 500 * 100))

# displaying the data frame
df

     Name  Univ_Marks  Percentage
0   Rohan         455        91.0
1  Elvish         250        50.0
2  Deepak         495        99.0
3     Sai         400        80.0
4   Radha         350        70.0
5   Vansh         450        90.0